---
kind: other
id: Methods.T:Autodesk.Revit.DB.LogicalOrFilter
source: html/f52bb7a6-f307-6f40-1994-2895a913423f.htm
---
# LogicalOrFilter Methods

Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.